Autodesk.Revit.DB.SiteLocation.SaveToLinkType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String,System.String,Autodesk.Revit.DB.AdvancedGeolocationLinkInfo)
Save the site into specific LinkType, if the type has one already, it will be updated
document:
The document of the LinkType.
linkTypeId:
The LinkType to be saved into.
geoSiteName:
The site name to save.
geoCoordinateSystem:
The coordinate system name to save.
advancedGeolocationInfo:
optional collection of advanced parameters for creating AdvancedGeoloation based on link
if null, then advanced geolocation will be based on CRS or not created if that does not exist.
Returns:
The saved site.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The element linkTypeId does not exist in the document
-or-
geoSiteName cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2019